ReyCSA/VHDL/DistorcionadorDeGuitarra/Workspace13/Design01.cydsn/Generated_Source/PSoC4/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.2
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2018 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "ADC_SAR_Seq_1.h"
#include "Pin_1.h"
#include "Pin_1_aliases.h"
#include "Pin_4.h"
#include "Pin_4_aliases.h"
#include "Bootloadable_1.h"
#include "Pin_3.h"
#include "Pin_3_aliases.h"
#include "Pin_2.h"
#include "Pin_2_aliases.h"
#include "DAC.h"
#include "Pin_10.h"
#include "Pin_10_aliases.h"
#include "Control_Reg_1.h"
#include "Pin_5.h"
#include "Pin_5_aliases.h"
#include "Pin_6.h"
#include "Pin_6_aliases.h"
#include "Pin_7.h"
#include "Pin_7_aliases.h"
#include "Pin_8.h"
#include "Pin_8_aliases.h"
#include "Pin_9.h"
#include "Pin_9_aliases.h"
#include "ADC_SAR_Seq_1_IRQ.h"
#include "ADC_SAR_Seq_1_intClock.h"
#include "core_cm0_psoc4.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cyPm.h"
#include "cytypes.h"
#include "cypins.h"
#include "CyLFClk.h"
#include "cy_em_eeprom.h"

/*[]*/

